//
//  DetailsText.swift
//  orcs
//
//  Created by Mykyta Havrylenko on 04.07.2022.
//

import Foundation

struct DetailsManager {
    
    // For UI display
    var nameOfSubject: String?
    var numberOfLosses: String?
    var subjectImage: String?
    
    var dayOfInvasion: Int?
    
    var dayOfInvasionString: String {
        return String(dayOfInvasion!)
    }
    
    func getDetailsText() -> String {
        
        // define the needed text
        return nameOfSubject == "Особовий склад" ?
        textPersonnelTemplate : textEquipmentTemplate
    }

//MARK: - TextTemplates
    
    private var textPersonnelTemplate: String  {
        return
        
"""
Станом на \(dayOfInvasionString)-й день повномасштабного вторгнення, \
Збройні Сили України вже знищили приблизно \(numberOfLosses!) \
російських окупантів.

Бої тривають на величезній території, і кожного дня наші військові \
ліквідують велику кількість осіб особового складу ворога.

"Ми змушені захищатись фактично від усієї російської армії. \
Всі боєздатні російські військові формування Росії залучені \
до цієї агресії", — нагадав Президент Зеленський.

Бий окупанта! Разом переможемо! Наша сила ‒ в правді!
"""
        
    }
    
   private var textEquipmentTemplate: String  {
        return
        
"""
Станом на \(dayOfInvasionString)-й день повномасштабного вторгнення, \
Збройні Сили України знищили велику кількість техніки \
російських окупантів, у цьому ж числі \(nameOfSubject!): приблизно \
\(numberOfLosses!) од.

\(equipmentDetails)

Бий окупанта! Разом переможемо! Наша сила ‒ в правді!
"""
        
    }
    
    
//MARK: - TextTemplatesDetails
    
   private var equipmentDetails: String {
        switch nameOfSubject {
        case "Літаки": return
"""
Наразі наші ЗСУ можуть похвалитися такими збитими \
літаками окупантів як Су-24, Су-25, Су-34, Су-35, та багатьма іншими.
"""
        case "Гелікоптери": return
"""
Загарбники використовують такі гелікоптери як Мі-35, Ка-52 та Мі-17, \
що складають дуже гарну пару для нашої ППО та ПЗРК!

Відрізнити ворожі вертольоти від наших можна за двума смугами та жовтим колом: \
в окупантів такої розмітки немає.
"""
        case "Танки": return
"""
Кожного дня окупанти стягують невідому кількість своїх танків з усієї росії, \
але що зрозуміло вже на сто відсотків: всі вони будуть або знищеними, \
або захопленими, або порізаними на металобрухт!
"""
        case "БТР": return
"""
Треба зазначити та визнати, що платформа для більшості нинішніх БТРів окупантів \
створена з урахуванням і копіюванням сталих західних тенденцій.

"Не маючі аналогів у світі" БТРи і ті - або скопійовані, або були розроблені \
ще за часів СССР.
"""
        case "Польова артилерія": return
"""
Сили оборони України кожного дня продовжують ідентифікувати та уражати позиції \
артилерії окупаційних військ рф.
"""
        case "РСЗВ": return
"""
Так кажуть наші хлопці з поля бою щодо знищення РСЗВ окупантів: \
"По-перше, це - красиво. Але, насамперед - необхідно".
"""
        case "Дрони": return
"""
Окупанти використовують дрони для корегувань своїх атак, \
але наші дрони-камікадзе, окрім схожих цілей, ще й можуть перервати застілля \
окупантів у полі.
"""
        case "Кораблі": return
"""
Приємно дивитись як палають кораблі московитських окупантів, \
а особливо як йде на дно корабель "москва"
"""
        case "ББМ": return
"""

"""
        case "Цистерни з ППМ": return
"""

"""
        case "Засоби ППО": return
"""

"""
        case "Спецтехніка": return
"""

"""
        case "Установки ОТРК": return
"""

"""
        case "Автотехніка": return
"""

"""
        case "Крилаті Ракети": return
"""

"""
        default: return "Якась неіснуюча техніка"
        }
    }
    
}
